In [4]:
import pandas as pd

# 이름 = pd.Series(['데이터값1', '데이터값2', '데이터값3'.....], index=['인덱스명1', '인덱스명2', '인덱스명3'....])

In [9]:
growth = pd.Series([143, 150, 157, 160], index=["2018", "2019", "2020", "2021"])
growth

2018    143
2019    150
2020    157
2021    160
dtype: int64

In [12]:
growth["2018"]

143

In [17]:
index = ['2018','2019','2020','2021']

Yeonghee = pd.Series([143,150,157,160], index=index)
Cheolsu = pd.Series([165,172,175,180], index=index)

growth = pd.DataFrame({
    '영희': Yeonghee,
    '철수': Cheolsu         
})

growth

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2021  160  180

In [23]:
print(growth.dtypes)

growth.astype('float')

영희    int64
철수    int64
dtype: object

         영희     철수
2018  143.0  165.0
2019  150.0  172.0
2020  157.0  175.0
2021  160.0  180.0

In [25]:
growth.astype({'영희':'float'})

         영희   철수
2018  143.0  165
2019  150.0  172
2020  157.0  175
2021  160.0  180

In [27]:
index = ['2018','2019','2020','2021']

data = {
    '영희': [143,150,157,160],
    '철수': [165,172,175,180]   
}

growth = pd.DataFrame(data, columns=['영희', '철수'], index=index)

growth

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2021  160  180